tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "melonamin/formulae"

# Notes
cask "obsidian" # Markdown / Plugin based note taking app

# Social 
cask "discord" # Slack for nerds or something
cask "slack" # The source of my anxiety

# Music
cask "spotify"

# Meetings
cask "zoom" # Not Teams

# Cloud Provider Tools
brew "awscli" # AWS CLi Tools
cask "google-cloud-sdk" # GCP CLI Tools
brew "azure-cli" # Azure CLI Tools

# HashiCorp Tools
cask "vagrant"
brew "consul"
brew "nomad"
brew "packer"
brew "terraform"
brew "vault" # 
brew "boundary" # Boundary CLI Binary
brew "sentinel" # Policy as Code Language
brew "waypoint"
cask "hashicorp-boundary-desktop" # Boundary Desktop Client

# CLI Tools
brew "htop" # Top but better
brew "httpie" # Better HTTP Client
brew "jq" # JSON Query
brew "yq" # YAML Query
brew "watch" # repeat commands
brew "wget" # http client
brew "mtr" # Better traceroute
brew "nmap" # Network Mapping tool
brew "ctop" # `top` for containers
brew "direnv" # Load/unload environment variables based on $PWD
brew "curl" # `curl` http client, macOS usually behind
brew "coreutils" # GNU File, Shell, and Text utilities
brew "gawk" # GNU `awk`
brew "bzip2" # bzip2 archives
brew "gnupg"
brew "telnet" # Yes, that telnet.
brew "netcat" # Network connection swiss army knife
brew "vim" # vi, /improved/
brew "zsh" # included macOS version is always old
brew "bandwhich" # network utilization by process etc.
brew "procs" # better `ps` alternative
brew "starship" # The best prompt, end of story.
brew "tldr" # Simplified `man` pages with an emphasis on examples
brew "rustscan" # better nmap
brew "ripgrep" # Faster `grep`
brew "speedtest-cli" # speedtest.net CLI client
brew "graphviz" # visualize .dot graphs from Terraform
brew "mas" # Mac App Store CLI
brew "go-task/tap/go-task" # Make but in go and easier to use
brew "1password-cli" # 1password but in the CLI
brew "tmux" # Friggin tmux
brew "age"
brew "sops"


# Replacement CLI Tools
brew "bat" # cat
brew "curlie" # curl
brew "duf" # df
brew "dust" # du
brew "exa" # ls
brew "fd" # find
brew "hwatch" # watch
brew "bottom" # top 

# Development Tools
brew "asdf" # A Universal Version Manager
brew "git" # Git
brew "git-extras"
brew "git-recent"
brew "pre-commit" # Pre Commit Hooks
brew "hugo" # Static website generator
brew "lazygit" # CLI tool for GIT because I am lazy sometimes
cask "visual-studio-code" # The best IDE, fight me
cask "insomnia" # REST API Client

# Kubernetes
brew "argocd" # ArgoCD CLI Tools
brew "eksctl" # AWS EKS CLI Tool
brew "kubernetes-cli" # kubectl
brew "k9s" # fancy `top` for kubernetes
brew "helm" # k8s Package Manager
brew "k2tf" # k8s YAML to Terraform converter
tap "fluxcd/tap"
brew "fluxcd/tap/flux" # flux2 CLI Tools
brew "dive" # docker image inspector
brew "kubectx" # kubectx/kubens for easy context switching
cask "docker" # docker desktop
brew "kustomize"


# Other IaC Tools
brew "ansible" # Not Terraform
brew "ansible-lint" # Thing that lints not Terraform

# Languages
## Golang
brew "go" # Gopher language or something

## Python
brew "python" # It's a freakin snake
brew "pyenv" # Environment Management
brew "poetry" # Dependency Management

# Pre-Commit Binaries
## Terraform
brew "terraform-docs"
brew "tflint" 
brew "tfsec" 
tap "hashicorp/tap"
brew "hashicorp/tap/terraform-ls" # Terraform Language Server (for vscode etc)
brew "checkov" # Terraform Security Checks
brew "tfupdate" # Sets / Updates Terraform required versions when doing development

## Shell
brew "shellcheck" # Shell script linter
brew "shfmt" # Shell formatting linter

# Better Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "session-manager-plugin"

# GUI Tools
cask "trex" # Opensource OCR Solution
cask "the-unarchiver" # Unarchiving Utility
cask "alt-tab" # Windows based Alt+Tab but on a Mac
cask "fig" # CLI based autocomplete and dot file syncing tool
cask "aldente" # Battery Optimization (Better than the one in OSX)
cask "pika" # Color matching utility that generates hex codes to use
cask "alfred" # Application Launching, Workflows, Search, etc. 
cask "appcleaner" # Application Remover 
cask "stats" # Sytem Stats in your top bar 
cask "iterm2" # Better Terminal 
cask "betterdisplay" # Better external display support
cask "1password" # Password Manager
cask "latest" # Checks for application updates